# **MI PROYECTO**

## **FASE 1**

### Se identifico como varables clave las columnas del siguiente dataframe

In [72]:
import pandas as pd
data=pd.read_csv('datset.csv')

data

,ORDEN,CLASE,MARCA,MODELO,FECHA MATRICULA/RADICACION,AÑO,MES,DIA
0,1,MOTOCICLETA,YAMAHA,2000,02/02/2000,2000,02.febrero,02.miércoles
1,2,MOTOCICLETA,SUZUKI,2000,23/02/2000,2000,02.febrero,23.miércoles
2,3,MOTOCICLETA,AUTECO KAWASAKI,2000,25/09/2000,2000,09.septiembre,25.lunes
3,4,AUTOMOVIL,RENAULT,1988,18/09/2000,2000,09.septiembre,18.lunes
4,5,CAMIONETA,CHEVROLET,1988,24/03/2000,2000,03.marzo,24.viernes
...,...,...,...,...,...,...,...,...
16938,16939,MOTOCICLETA,BAJAJ,2022,21/01/2022,2022,01.enero,21.viernes
16939,16940,MOTOCICLETA,VICTORY,2022,27/01/2022,2022,01.enero,27.jueves
16940,16941,MOTOCICLETA,BAJAJ,2022,25/01/2022,2022,01.enero,25.martes
16941,16942,MOTOCICLETA,BAJAJ,2022,28/01/2022,2022,01.enero,28.viernes
16942,16943,MOTOCICLETA,AKT,2022,10/02/2022,2022,02.febrero,10.jueves

## **FASE 2**

### Se realizara la limpieza correspondiente

In [75]:
print(data.isnull().sum())

ORDEN                         0
CLASE                         0
MARCA                         0
MODELO                        0
FECHA MATRICULA/RADICACION    0
AÑO                           0
MES                           0
DIA                           0
dtype: int64

In [76]:
falta=data[data.isnull().any(axis=1)] 

falta

Empty DataFrame
Columns: [ORDEN, CLASE, MARCA, MODELO, FECHA MATRICULA/RADICACION, AÑO, MES, DIA]
Index: []

In [91]:
data["FECHA MATRICULA/RADICACION"] = pd.to_datetime(data["FECHA MATRICULA/RADICACION"])

df = data.drop_duplicates()

ValueError: time data "23/02/2000" doesn't match format "%m/%d/%Y", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

## **FASE 3**

In [89]:
data_2=data.loc[:,["CLASE"]]
data_2

             CLASE
0      MOTOCICLETA
1      MOTOCICLETA
2      MOTOCICLETA
3        AUTOMOVIL
4        CAMIONETA
...            ...
16938  MOTOCICLETA
16939  MOTOCICLETA
16940  MOTOCICLETA
16941  MOTOCICLETA
16942  MOTOCICLETA

[16943 rows x 1 columns]

In [87]:
import numpy as np

datanp=data_2.to_numpy()

In [85]:
clases_unicas, conteos = np.unique(datanp, return_counts=True)
for clase, count in zip(clases_unicas, conteos):
    print(f"{clase}: {count}")

AUTOMOVIL: 3965
BUS: 109
BUSETA: 68
CAMION: 825
CAMIONETA: 1357
CAMPERO: 976
CICLOMOTOR: 3
CUATRIMOTO: 5
MAQUINARIA AGRICOLA: 3
MAQUINARIA INDUSTRIAL: 1
MICROBUS: 115
MINITRACTOR: 1
MOTOCARRO: 50
MOTOCICLETA: 9047
MOTOTRICICLO: 2
REMOLQUE: 20
SEMIREMOQLUE: 6
TRACTO CAMION: 256
VOLQUETA: 134

In [ ]:
print(clases_unicas)
print(type(clases_unicas))

In [83]:
print(conteos)

[3965  109   68  825 1357  976    3    5    3    1  115    1   50 9047
    2   20    6  256  134]

In [81]:

df = pd.DataFrame({'VEHICULOS':clases_unicas,'CANTIDAD':conteos})

df

                VEHICULOS  CANTIDAD
0               AUTOMOVIL      3965
1                     BUS       109
2                  BUSETA        68
3                  CAMION       825
4               CAMIONETA      1357
5                 CAMPERO       976
6              CICLOMOTOR         3
7              CUATRIMOTO         5
8     MAQUINARIA AGRICOLA         3
9   MAQUINARIA INDUSTRIAL         1
10               MICROBUS       115
11            MINITRACTOR         1
12              MOTOCARRO        50
13            MOTOCICLETA      9047
14           MOTOTRICICLO         2
15               REMOLQUE        20
16           SEMIREMOQLUE         6
17          TRACTO CAMION       256
18               VOLQUETA       134

In [ ]:
data